[{"id":4660,"name":"Introduction to Educational Technology","desc":"Introduction to the theory and practice of educational technology. Covers learning theory applicable to educational technology, explains major research findings.","prereqs":[]},{"id":1371,"name":"Computing for Engineers","desc":"<a href=\"javascript:history.go(-1)\" onMouseOver=\"window.status='Return to Previous';  return true\" onFocus=\"window.status='Return to Previous';  return true\" onMouseOut=\"window.status='';  return true\"onBlur=\"window.status='';  return true\">Return to Previous</a>","prereqs":[]},{"id":3804,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":4476,"name":"Introduction to Computer Vision","desc":"Introduction to computer vision including fundamentals of image formation, camera imaging geometry, feature detection and matching, stereo, motion estimation and tracking, image classification and scene understanding. Credit not awarded for both CS 6476 and CS 4495 or CS 4476.","prereqs":[]},{"id":4237,"name":"Computer and Network Security","desc":"Fundamental concepts and principles of computer security, operating system and database security, secret key and public key cryptographic algorithms, hash functions, authentication, firewalls and intrusion detection systems, IPSec ad VPN, and wireless security.","prereqs":[3251]},{"id":4635,"name":"Knowledge-Based Artificial Intelligence","desc":"Structured knowledge representation; knowledge-based methods of reasoning and learning; problem-solving, modeling and design.","prereqs":[3600]},{"id":4741,"name":"Integrative Management Development-Project Preparation","desc":"Individual and group-based experiential learning activities to develop integrated human system management skills that prepare students for more successful capstone collaboration and learning.  Credit not allowed for both CS 4741 and MGT 4741 or ME 4741.","prereqs":[]},{"id":1331,"name":"Introduction to Object Oriented Programming","desc":"Introduction to techniques and methods of object-oriented programming such an encapsulation, inheritance, and polymorphism. Emphasis on software development and individual programming skills.","prereqs":[1301,1315,1321,1371]},{"id":3803,"name":"Special Topics","desc":"Courses in special topics of timely interest to the profession conducted by resident or visiting faculty.","prereqs":[]},{"id":4616,"name":"Pattern Recognition","desc":"An introductory course on pattern classification and decision problems with applications to character recognition, image analysis, and speech recognition.","prereqs":[1331]},{"id":4220,"name":"Programming Embedded Systems","desc":"Design principles, programming techniques, and case studies of embedded real-time systems.  Interface techniques and devices.  Representations and reasoning about physical processes.","prereqs":[2200]},{"id":3790,"name":"Introduction to Cognitive Science","desc":"Multidisciplinary perspectives on cognitive science. Interdisciplinary approaches to issues in cognition, including memory, language, problem solving, learning, perception, and action. Crosslisted with PST, PSYC, and ISYE 3790.","prereqs":[]},{"id":4649,"name":"Robot Intelli Planning","desc":"We investigate algorithms for robots and complex systems that make intelligent decisions.  Emphasis on the theoretical and empirical properties of classical, geometric, stochastic/dynamic planning.","prereqs":[1332]},{"id":2200,"name":"Computer Systems and Networks","desc":"A broad exposure to computer system structure and networking including software abstractions in operating systems for orchestrating the usage of the computing resources.","prereqs":[2110]},{"id":3600,"name":"Introduction to Artificial Intelligence","desc":"An introduction to artificial intelligence and machine learning. Topics include intelligent system design methodologies, search and problem solving, supervised and reinforced learning.","prereqs":[1332]},{"id":3251,"name":"Computer Networking I","desc":"Introduction to problems in computer networking, including error recovery, medium access, routing, flow control, and transport. Emphasis on current best practice.  Includes programming of networked applications.","prereqs":[2200]},{"id":4455,"name":"Video Game Design and Programming","desc":"Techniques for electronic game design and programming, including graphics game engines, motion generation, behavioral control for autonomous characters, interaction structure, social and interface issues of multi-user play, and the business aspects of game development.  Credit not allowed for both CS 4455 and CS 6457.","prereqs":[3451]},{"id":3801,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":4290,"name":"Advanced Computer Organization","desc":"Topics concerning the hardware design of computer systems. Advanced techniques in high-performance pipelined central processing units. Memory and I/O systems. Parallel processors including shared-memory multiprocessors and cluster computers.  Credit is not allowed for both CS 4290 and any of the following courses:  CS 6290, ECE 4100, ECE 6100.","prereqs":[2200]},{"id":4792,"name":"Design Project in Cognitive Science","desc":"Individual project with a cognitive science faculty member, designed as a supplement to the student's senior design project or thesis in their major area.  Crosslisted with PST, PSYC, and ISYE 4792.","prereqs":[]},{"id":4001,"name":"Computing, Society, and Professionalism","desc":"Examines the role and impact of information and communication technology in society, with emphasis on ethical, professional, and public policy issues. Credit not allowed for both CS 4001 and 4002.","prereqs":[]},{"id":2701,"name":"Startup Lab: Introduction to Technology Ventures","desc":"Elements of technology venture creation including opportunity identification and validation, ideation, customer discovery, markey analysis, minimum viable product development, business models, intellectual property, and capital raises. Cross-listed with COE 2701.","prereqs":[]},{"id":4432,"name":"Information Systems Design","desc":"The analysis, design, and implementation of information systems.  Topics include requirements analysis, design representations, implementation techniques, and evaluation of systems.","prereqs":[3300,4400]},{"id":2261,"name":"Media Device Architectures","desc":"Controlling the interface between hardware and software in media devices. Machine-level programming (e.g., in C) to create graphics, generate sound, and support user interaction.","prereqs":[1331]},{"id":3743,"name":"Analysis of Emerging Technologies","desc":"Analysis of emerging technologies and their impacts for firm practice, market practice, policy, and society. Credit not allowed for both CS 3743 and MGT 3743 or ME 3743.","prereqs":[]},{"id":4560,"name":"Verification of Systems","desc":"Technique for verifying, validating and testing software and hardware systems. Topics covered will include modeling, abstraction methods, evaluation and certification, and computer-aided verification methods.","prereqs":[1050,3510]},{"id":4611,"name":"Artificial Intelligence Problem Solving","desc":"Basic concepts and methods of AI problem solving, knowledge representation, reasoning, and learning.","prereqs":[3600]},{"id":1301,"name":"Introduction to Computing","desc":"Introduction to computing principles and programming practices with an emphasis on the design, construction and implementation of problem solutions use of software tools.","prereqs":[]},{"id":2804,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":1802,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":3630,"name":"Introduction to Perception and Robotics","desc":"Covers fundamental problems and leading solutions for computer and robot perception and action from the point of view of autonomous robot navigation.","prereqs":[1332]},{"id":3240,"name":"Languages and Computation","desc":"Interpreters as abstract machines and the tools used to construct them, such as scanners and parsers. An introduction to models of computation as embodied by different programming languages.  Limits of and relationships between these models.","prereqs":[2340]},{"id":2803,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":4802,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by","prereqs":[]},{"id":4690,"name":"Empirical Methods for User Interface Design and Evaluation","desc":"Introduction to empirical methods for gathering requirements and evaluating the end-user and usability of software systems.","prereqs":[3750]},{"id":1316,"name":"Representing Structure and Behavior","desc":"Modeling the structure of media (e.g., music, graphical scenes) using dynamic data structures. Designing objects as encapsulations of structure and behavior. Algorithms for simulating objects. May not be taken for credit by students who have credit for CS 1322.","prereqs":[1301,1315,1371]},{"id":4240,"name":"Compilers, Interpreters, and Program Analyzers","desc":"Study of techniques for the design and implementation of compilers, interpreters, and program analyzers, with consideration of the particular characteristics of widely used programming languages.","prereqs":[2340]},{"id":2335,"name":"Software Practicum","desc":"Methods for solving large programming problems. Techniques for quality assurance, managing programs, working in teams, analyzing problems, and producing effective solutions.","prereqs":[1332]},{"id":4675,"name":"Internet Computing Systems, Services and Applications","desc":"Focusing on fundamental issues, concepts, techniques, and technical challenges that are critical for designing and developing Internet systems, services and applications.  Credit not allowed for both CS 4675 and CS 6675.","prereqs":[2200]},{"id":4452,"name":"Human-Centered Computing Concepts","desc":"Introduction to programming and human-centered principles of computing based on a communications and media computation context. Introduces user interface programming.","prereqs":[]},{"id":4365,"name":"Introduction to Enterprise Computing","desc":"A survey of basic software tools and techniques used in mission-critical systems and applications, combined with in-depth study of fundamental principles underlying enterprise computing.  Credit not allowed for both 4365 and CS 6365.","prereqs":[3210,4400]},{"id":4460,"name":"Introduction to Information Visualization","desc":"Introduction to principles and techniques of infomation visualization, the presentation of primarily abstract data to help people understand, analyze and make sense of data.","prereqs":[1331]},{"id":3510,"name":"Design and Analysis of Algorithms","desc":"Basic techniques of design and analysis of efficient algorithms for standard computational problems. NP-Completeness.  Credit not allowed for both CS 3510 and CS 3511.","prereqs":[2050,2051,1332]},{"id":4440,"name":"Emerging Database Technologies and Applications","desc":"The course will cover current developments including distributed, object-oriented, temporal-spatial, Web-based, mobile, and active database technologies, and data warehousing and mining applications.","prereqs":[4400]},{"id":4420,"name":"Database System Implementation","desc":"Study of fundamental software components/algorithms of a database system, including the file manager, query engine, lock manager, and recovery manager.  Includes a project component.  Credit not allowed for both CS 4420 and CS 6422.","prereqs":[4400]},{"id":1372,"name":"Structured Program Design for Engineers","desc":"Design, analysis and implementation of programs for engineering problem-solving using ANSI Standard C, with an introduction to C++.","prereqs":[1171,1371,1301]},{"id":4665,"name":"Educational Technology: Design and Evaluation","desc":"Intensive project class in which students design, implement, and evaluate a piece of educational technology, applying the theory learned in Introduction  to Educational Technology.","prereqs":[4660]},{"id":3311,"name":"Part 1 of a 2 semester project design and implementation sequence conjoined with Tech Communications","desc":"Part 1 of a 2 semester project design and implementation sequence conjoined with Technical Communications. Prepare requirements, design and project plans.  Develop a basic prototype of the desired system. Project is completed in CS 3312-Project Implementation. Credit will not be awared for CS 3311 and CS 4911.","prereqs":[2340]},{"id":4320,"name":"Introduction to Software Processes","desc":"The course will provide students with an overall context in which software systems are developed from the viewpoint of processes that support development.  Software engineering is described as the set of activities developers engage in to create high-quality products within schedule and budget constraints.","prereqs":[3300]},{"id":4392,"name":"Programming Languages","desc":"<br />","prereqs":[3240]},{"id":4801,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":4210,"name":"Advanced Operating Systems","desc":"Operating system abstractions and their implementations, multi-threading, efficient inter-address communication, high-level synchronization, introduction to multi-processor and distributed operating systems, real-time systems.","prereqs":[2200]},{"id":1332,"name":"Data Structures and Algorithms for Applications","desc":"Computer data structures and algorithms in the context of object-oriented programming. Focus on software development towards applications.","prereqs":[1322,1331]},{"id":4912,"name":"Design Capstone Project","desc":"Team-based capstone experience allowing students to analyze a problem for a customer and manage the solution development through the full project life cycle.","prereqs":[2340]},{"id":4625,"name":"Intelligent and Interactive Systems","desc":"Explores how human-computer interaction and machine learning can interact to create personalized information environments. Emphasis on current research efforts from both fields.","prereqs":[1331]},{"id":2050,"name":"Introduction to Discrete Mathematics for Computer Science","desc":"Proof methods, strategy, correctness of algorithms over discrete structures.  Induction and recursion.  Complexity and order of growth.  Number theoretic principles and algorithms.  Counting and computability.  Credit not allowed for both CS 2050 and CS 2051.","prereqs":[]},{"id":4010,"name":"Introduction to Computer Law","desc":"Provides an introduction to copyrights, patents, trade secrets, trademarks, and commercial law pertaining to computer software and hardware.","prereqs":[]},{"id":4632,"name":"Advanced Intelligent Robotics","desc":"Hands-on course in which students program autonomous mobile robots and solve complex tasks for robot teams.","prereqs":[3630]},{"id":4670,"name":"Computer-Supported Collaborative Learning","desc":"Research and practice in computer-supported collaborative learning. Review of existing systems and research, as well as evaluation and design methods.","prereqs":[4660]},{"id":4496,"name":"Computer Animation","desc":"Motion techniques for computer animation and interactive games (keyframing, procedural methods, motion capture, and simulation) and principles for storytelling, composition, lighting, and interactivity.","prereqs":[3451]},{"id":4685,"name":"Pervasive Systems and Networking","desc":"In-depth study of systems and wireless networking issues in enabling pervasive computing environments and applications using a hand-on approach.","prereqs":[2200]},{"id":4650,"name":"Natural Language Understanding","desc":"Methodologies for designing systems that comprehend natural language. Topics include lexical analysis, parsing, interpretation of sentences, semantic representation, organization of knowledge, and inference mechanisms.  Credit not allowed for both CS 4650 and CS 7650.","prereqs":[1331]},{"id":4791,"name":"Integrative Project in Cognitive Science","desc":"An integrative course in cognitive science focusing on the integration and use of concepts and skills from cognitive science.  A different integrative project or set of projects will be taken on each semester; students will contribute on the basis of their background and skill.  Crosslisted with PST, PSYC, and ISYE 4791.","prereqs":[]},{"id":4475,"name":"Computational Photography","desc":"An introductory course on the scientific, technical, perceptual, and aesthetic principles of pictures. Emphasis is on the techniques of image formation, analysis, merging, modification and their use for depiction of reality on a 2D medium of photographs.","prereqs":[1301,1315,1371]},{"id":4261,"name":"Mobile Applications and Services for Converged Networks","desc":"This course provides an introduction to mobile applications and services with an emphasis on voice and data service integration in modern commercial networks.","prereqs":[2200]},{"id":4745,"name":"Information and Communication Technologies and Global Development","desc":"Focus on technology design, adoption, and use as seen through the lens of global development.","prereqs":[]},{"id":4235,"name":"Introduction to Information Security","desc":"Terms/concepts, threats, controls; problem definition; comprehensive information security model; security for operating systems, databases, network/distributed systems; administering security; legal/ethical/policy issues.  Credit not allowed for both CS 4235 and CS 6035.","prereqs":[1301,1315,1371]},{"id":4646,"name":"Machine Learning for Trading","desc":"Introduces machine learning based trading strategies. Topics:  Information processing, probabilistic analysis, portfolio construction, generation of market orders, KNN, random forests. Credit not awarded for both CS 4646 and CS 7646.","prereqs":[]},{"id":1803,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":2340,"name":"Objects and Design","desc":"Object-oriented programming methods for dealing with large programs.  Focus on quality processes, effective debugging techniques, and testing to assure a quality product.","prereqs":[1331,1372,1316]},{"id":4590,"name":"Principles and Applications of Computer Audio","desc":"A well-rounded exploration of digital audio and its importance in current research and applications. Exposes students to the principles, technology, and current research of computer audio.","prereqs":[]},{"id":4893,"name":"Special Topics","desc":"<br />","prereqs":[]},{"id":3300,"name":"Introduction to Software Engineering","desc":"Team-based project class to introduce and apply software engineering principles and practices.","prereqs":[2340]},{"id":1805,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":1315,"name":"Introduction to Media Computation","desc":"Introduction to computation (algorithmic thinking, data structures, data transformation and processing, and programming) in a media and communication context. Credit not awarded for both CS 4452 and CS 1315.","prereqs":[]},{"id":4605,"name":"Mobile and Ubiquitous Computing","desc":"Investigates the infrastructure required to develop mobile and ubiquitous computing applications and establishes major research themes and experimental practices.","prereqs":[2110,2261]},{"id":1171,"name":"Introductory Computing in MATLAB","desc":"For students with a solid introductory computing background needing to demonstrate proficiency in the MATLAB language.","prereqs":[1301,15,13,1315]},{"id":4330,"name":"Software Engineering Applications","desc":"Software engineering methods specific to classes of applications or systems, including information systems and embedded, real-time systems.","prereqs":[3300]},{"id":4742,"name":"Integrated Computing and Management Capstone Project","desc":"Project-based course for students in Computing and Management minor to work in interdisciplinary teams on projects provided by corporate affiliates.  Credit not allowed for both CS 4742 and MGT 4742 or ME 4742.","prereqs":[4741]},{"id":4464,"name":"Computational Journalism","desc":"A study of computational and technological advancements in","prereqs":[1331]},{"id":3101,"name":"Computer Science Ventures","desc":"Students will learn how computer-science-based ventures are developed.  The course is project-based.  Students propose, analylze, pitch, design, implement, package and market web-2.0 and virtual-world-based products and services.","prereqs":[1301,1315,1371]},{"id":4472,"name":"Design of Online Communities","desc":"Introduction to the design of online communities.  Students study an existing community in depth.  Credit not allowed for both CS 4472 and CS 6470.","prereqs":[]},{"id":4793,"name":"Integrative Perspectives in Cognitive Science","desc":"An integrative course in cognitive science which uses a focus topic to deepen interdisciplinary perspective and develop cognitive science knowledge and skills.","prereqs":[3790]},{"id":4270,"name":"Data Communications Laboratory","desc":"Detailed study of the principles of data transmission systems and their performance, reinforced by laboratory exercises.","prereqs":[3251]},{"id":1804,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":4520,"name":"Approximation Algorithms","desc":"Approximation algorithms for NP-hard optimization problems, design and analysis techniques for such algorithms.  Credit not allowed for both CS 4520 and CS 7520.","prereqs":[4540]},{"id":4641,"name":"Machine Learning","desc":"Machine learning techniques and applications. Topics include foundational issues; inductive, analytical, numerical, and theoretical approaches; and real-world applications.","prereqs":[1331]},{"id":4005,"name":"Next-Generation Computing Technologies","desc":"Students will explore new paradigms in how content is created, distributed, and consumed, with hands-on demos of next-generation computing technologies.","prereqs":[2316]},{"id":4280,"name":"Survey of Telecommunications and the Law","desc":"Overview of telecommunication regulation at the federal, state, and judicial levels; review of FCC policies and restrictions on Bell operating companies under the AT&T Consent Agreement.","prereqs":[]},{"id":2801,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":3651,"name":"Prototyping Intelligent Devices","desc":"Hands-on course teaching the fundamentals of electronics of electrical and mechanical prototyping.","prereqs":[]},{"id":4615,"name":"Knowledge-Based Modeling and Design","desc":"Information-processing theories of modeling and design; topics include design decision-making, problem-solving and learning, and knowledge-based modeling and design.","prereqs":[3600]},{"id":4540,"name":"Advanced Algorithms","desc":"Advanced techniques for designing and analyzing efficient algorithms for combinatorial, algebraic, and number theoretic problems.  Credit not allowed for both CS 4540 and CS 6550.","prereqs":[3510,3511]},{"id":4251,"name":"Computer Networking II","desc":"Principles of computer networks, including medium access, ARQ protocols, routing, congestion avoidance, and control. Emphasis on design options and tradeoffs. Includes significant network application programming.","prereqs":[3251]},{"id":4342,"name":"Software Generation, Testing, and Maintenance","desc":"Methods and principles for program generation, testing, and managing the evolution of software systems.","prereqs":[3300]},{"id":4710,"name":"Introduction to Computing Concepts for Bioinformatics","desc":"Introduction to programming concepts and computing tools such as formal models and algorithms with applications from conceptual biology.  May not be used by computer science majors for degree credit.","prereqs":[]},{"id":3750,"name":"Human Computer Interface Design and Evaluation","desc":"Human computer interface is considered in terms of user-system compatibility. Concepts in human factors and interface design are covered in relation to capabilities of both humans and computers. Crosslisted with PSYC 3750.","prereqs":[]},{"id":4803,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":4530,"name":"Randomized Algorithms","desc":"Efficient randomized algorithms with improved performance over deterministic algorithms, or for NP-hard optimization problems, design and analysis techniques for such algorithms.  Credit not allowed for both CS 4530 and CS 7530.","prereqs":[4540]},{"id":4731,"name":"Game AI","desc":"Examines the expressive possibilities of artificial intelligence techniques in computer games. Students learn AI programming techniques, and how they strongly interface with game design.","prereqs":[3600]},{"id":4752,"name":"Philosophical Issues in Computation","desc":"Metaphysical and epistemological issues in the foundations, methods, and implications of computing. Issues include: minds, brains, and machines; representation and language; simulating nature. Crosslisted with PST 4752.","prereqs":[]},{"id":3451,"name":"Computer Graphics","desc":"<a href=\"javascript:history.go(-1)\" onMouseOver=\"window.status='Return to Previous';  return true\" onFocus=\"window.status='Return to Previous';  return true\" onMouseOut=\"window.status='';  return true\"onBlur=\"window.status='';  return true\">Return to Previous</a>","prereqs":[2110,2261,1332,2340]},{"id":4480,"name":"Digital Video Special Effects","desc":"A study of digital multimedia and the analysis and synthesis of digital video.  Special attention paid to techniques for generating video special effects.","prereqs":[3451]},{"id":4613,"name":"Knowledge Systems Engineering","desc":"Techniques for constructing large knowledge-based systems. Advanced symbolic AI techniques. Constraint systems.","prereqs":[3600]},{"id":4260,"name":"Telecommunications Systems","desc":"Survey of research concerned with the nature and causes of adult age differences in behavior.","prereqs":[]},{"id":1100,"name":"Freshman Leap Seminar","desc":"Small group discussions with first year students are led by one or more faculty members and include a variety of foundational, motivational, and topical subjects for computationalist.","prereqs":[]},{"id":4052,"name":"Systems Analysis and Design","desc":"An introductory course on the development life cycle of business information systems.  It covers analysis and design tools and methodology.  Credit not allowed for both CS 4052 and MGT 4045.","prereqs":[]},{"id":2802,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":4002,"name":"Robots and Society","desc":"Examines the role and impact of robotics, distributed sensing and actuation, ubiquitous computing and related technology in society, emphasizing ethical, professional and public policy issues. Credit not allowed for both CS 4001 and 4002","prereqs":[]},{"id":4400,"name":"Introduction to Database Systems","desc":"Comprehensive coverage of mainstream database concepts such as the entity-relationship model, relational databases, query languages, and database design methodology. Includes a project.  Credit not allowed for both CS 4400 and CS 6402.","prereqs":[1301,1315,1371]},{"id":4233,"name":"Parallel Computer Architecture","desc":"The objective of this course is to develop an in-depth understanding of the design, implementation, and evaluation of modern parallel computers.  Credit not allowed for both CS 4233 and CS 7110.","prereqs":[3210]},{"id":2316,"name":"Data Manipulation for Science and Industry","desc":"Reading, manipulating, and exporting data for engineering, business, and scientific applications.  Covers GUI's, File I/O, basic SQL, and web scraping.  Emphasis on software development.","prereqs":[1371,1301,1315]},{"id":4550,"name":"Scientific Data Processing and Visualization","desc":"Foundations and algorithms underlying the development and application of tools for the efficient transmission, analysis, filtering, and visualization of large scientific data sets.","prereqs":[3451]},{"id":2600,"name":"Knowledge Representation and Processing","desc":"Introduction to the representation and manipulation of complex symbolic and sub-symbolic information.","prereqs":[1301,1315,1371]},{"id":4470,"name":"Introduction to User Interface Software","desc":"Concepts, techniques, structures, and strategies for implementation of interactive software.","prereqs":[2340,3750]},{"id":2051,"name":"Honors - Induction to Discrete Mathematics for Computer Science","desc":"Proof methods, strategy, correctness of algorithms over discrete structures.  Induction and recursion.  Complexity and order of growth.  Number theoretic principles and algorithms.  Counting and computability.  Credit not allowed for both CS 2051 and CS 2050.","prereqs":[]},{"id":1801,"name":"Special Topics","desc":"Courses of timely interest to the profession, conducted by resident or visiting faculty.","prereqs":[]},{"id":3220,"name":"Computer Structures: Hardware/Software Codesign of a Processor","desc":"Principles in pipelined processor design, with emphasis on the need for a close interaction between code generation and architecture.","prereqs":[2200]},{"id":3511,"name":"Design and Analysis of Algorithms, Honors","desc":"Techniques of design and analysis of efficient algorithms for standard computational problems.  NP-Completeness Project.  Credit not allowed for both CS 3511 and CS 3510.","prereqs":[2050,2051,1332]},{"id":3312,"name":"Part 2 of a semester project design and implementation sequence conjoined with Tech Communications","desc":"The second part of a 2 semester project design and implementation sequence conjoined with Technical Communications. Implement a project designed in CS 3311. Credit will not be awarded for CS 3312 and CS 4911.","prereqs":[2340]},{"id":3210,"name":"Design of Operating Systems","desc":"Operating systems concepts, including multi-threading, scheduling, synchronization, communication, and access control.  Projects will cover design and implementation of several operating systems components.","prereqs":[2200]},{"id":4245,"name":"Introduction to Data Mining and Analysis","desc":"Computational techniques for analysis of large, complex datasets, covering fundamental aspects as well as modern data mining and analysis techniques. Cross-listed with ISYE 4245.","prereqs":[1332,1372]},{"id":4495,"name":"Computer Vision","desc":"An introduction to computer vision and machine perception. An intensive study of the process of generating a symbolic description of the scene by interpretation of images(s). Credit not awarded for both CS 4495 and CS 6476.","prereqs":[2110,2261]},{"id":4510,"name":"Automata and Complexity Theory","desc":"Computational machine models and their language classes. Undecidability. Resource-bounded computations. Central complexity-theoretic concepts such as complexity classes, reducibility and completeness.","prereqs":[3510,3511]},{"id":2110,"name":"Computer Organization and Programming","desc":"<a href=\"javascript:history.go(-1)\" onMouseOver=\"window.status='Return to Previous';  return true\" onFocus=\"window.status='Return to Previous';  return true\" onMouseOut=\"window.status='';  return true\"onBlur=\"window.status='';  return true\">Return to Previous</a>","prereqs":[]},{"id":3802,"name":"Special Topics","desc":"<a href=\"javascript:history.go(-1)\" onMouseOver=\"window.status='Return to Previous';  return true\" onFocus=\"window.status='Return to Previous';  return true\" onMouseOut=\"window.status='';  return true\"onBlur=\"window.status='';  return true\">Return to Previous</a>","prereqs":[]},{"id":3001,"name":"Computing, Society, and Professionalism","desc":"<a href=\"javascript:history.go(-1)\" onMouseOver=\"window.status='Return to Previous';  return true\" onFocus=\"window.status='Return to Previous';  return true\" onMouseOut=\"window.status='';  return true\"onBlur=\"window.status='';  return true\">Return to Previous</a>","prereqs":[]},{"id":2345,"name":"Advanced Practical Object-Oriented Programming","desc":"","prereqs":[]},{"id":4805,"name":"Special Topics","desc":"","prereqs":[]},{"id":3805,"name":"Special Topics","desc":"","prereqs":[]},{"id":4057,"name":"Business Process Analysis and Design","desc":"","prereqs":[]},{"id":4003,"name":"AI, Ethics, and Society","desc":"","prereqs":[]},{"id":4770,"name":"Mixed Reality Experience Design","desc":"","prereqs":[]},{"id":4873,"name":"Special Topics","desc":"","prereqs":[]},{"id":3873,"name":"Special Topics","desc":"","prereqs":[]},{"id":4723,"name":"Inter Capstone Design","desc":"","prereqs":[]},{"id":4497,"name":"Computational Aesthetics","desc":"","prereqs":[]},{"id":4883,"name":"Special Topics","desc":"","prereqs":[]},{"id":3744,"name":"Managing Product, Service &amp; Technology Development","desc":"","prereqs":[]},{"id":4644,"name":"Deep Learning","desc":"","prereqs":[]},{"id":2805,"name":"Special Topics","desc":"","prereqs":[]},{"id":4726,"name":"Privacy, Technology, Policy, and Law","desc":"","prereqs":[]},{"id":4725,"name":"Information Security Strategies and Policies","desc":"","prereqs":[]},{"id":4853,"name":"Special Topics","desc":"","prereqs":[]},{"id":4622,"name":"Case-Based Reasoning","desc":"","prereqs":[]},{"id":4795,"name":"GPU Programming for Video Games","desc":"","prereqs":[]},{"id":4863,"name":"Special Topics","desc":"","prereqs":[]},{"id":4804,"name":"Special Topics","desc":"","prereqs":[]},{"id":4255,"name":"Introduction to Network Management","desc":"Introduction to SNMP-based network management.  Practical application to network and system management including hands-on lab practice.","prereqs":[3251]},{"id":4851,"name":"Special Topics","desc":"","prereqs":[]}]